Revit 2026 API

# RailTagentJoinOption Enumeration

---

The tangent joins of the rails.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RailTagentJoinOption
```
```vb
Public Enumeration RailTagentJoinOption
```
```cpp
public enum class RailTagentJoinOption
```
```fsharp
type RailTagentJoinOption
```

| Member name | Value | Description |
| --- | --- | --- |
| AddVerticalOrHorizontalSegments | 0 | Add vertical or horizontal segments. |
| ExtendRailsToMeet | 2 | Extend rails to meet. |
| NoConnector | 1 | No connector. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace